<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f60a946b1742ad71e7ec2800af176dc1a683122d960e201d4fc41e2747cdb1be","plan_job_ref":"Job Plan Airflow DAGs #236 at https://github.com/cal-itp/data-infra/actions/runs/16208410493","plan_out_hash":"f4833885c9e0f797b11af5cc25510dade90e0aff8cfcdc78e76bdf5483480109","plan_hash":"3c0e5d5ee13f525aa38ab18ce9fa1c6e9803e2c139a49e7f085576c13e40f6cd","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "ODsedQ==" -> (known after apply)
!~      detect_md5hash      = "utUJiseVlQQntrcr32OUlA==" -> "different hash"
!~      generation          = 1752161968345135 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "utUJiseVlQQntrcr32OUlA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "+DEXEQ==" -> (known after apply)
!~      detect_md5hash      = "CoiiIUdDaUGPv9Skzwt/sw==" -> "different hash"
!~      generation          = 1752161970009910 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "CoiiIUdDaUGPv9Skzwt/sw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "OzNfuQ==" -> (known after apply)
!~      detect_md5hash      = "gQDYRjFTdm3tOMNXeu84Og==" -> "different hash"
!~      generation          = 1752010341206630 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "gQDYRjFTdm3tOMNXeu84Og==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #236](https://github.com/cal-itp/data-infra/actions/runs/16208410493)